In [28]:
import pandas as pd
import numpy as np

# Construção das Tabelas que serão Utilizadas (**Ignorar**)

In [29]:
linhas = [["Tiago", np.nan], ["João", 3.2], ["Gustavo", 9.0], ["Pedro", np.nan], ["César", 6.5], ["Luís", np.nan], ["Mateus", np.nan], ["Luca", 1.7], 
          ["Yan", 5.0]]

In [30]:
mcar = pd.DataFrame(linhas, columns=["Nome", "CR"])

In [31]:
linhas = [["Tiago", 17, np.nan], ["João", 18, np.nan], ["Gustavo", 18, np.nan], ["Pedro", 19, np.nan], ["César", 20, np.nan], ["Luís", 21, 10.0], ["Mateus", 22, 2.5],
          ["Luca", 22, 1.7], ["Yan", 23, 5.0]]

In [32]:
mar = pd.DataFrame(linhas, columns=["Nome", "Idade", "CR"])

In [33]:
linhas = [["Tiago", 8.0], ["João", np.nan], ["Gustavo", 9.0], ["Pedro", np.nan], ["César", 6.5], ["Luís", 10], ["Mateus", np.nan], ["Luca", 7.5], 
          ["Yan", 5.0]]

In [34]:
mnar = pd.DataFrame(linhas, columns=["Nome", "CR"])

# 1. Introdução
## 1.1 O que é ?
<p> Valores nulos em bases de dados, também conhecidos como "Missing Data", fazem parte de um estudo muito importante para a Ciência de Dados, e equivalem a respostas não obtidas, dados que não conseguiram serem armazenados, ou dados que foram perdidos, antes do armazenamento, em resumo, são informações que são declaradas como nulas nas bases de dados, e, assim, não possível tirar uma conclusão perfeita sobre esse valor. </p>
<p> Dado que a maioria dessas bases são representadas como tabelas, as colunas equivalem ao tipo de informação e as linhas, a cada dado obtido, por exemplo em uma base de dados para estudantes de uma faculdade, cada linha iria representar um aluno, e iriam existir diversas colunas, como Curso Estudado, Período, Gênero e etc. Sendo assim, poderíamos ter diversos casos para que valores nulos apareçam, o melhor deles seriam valores isolados, no qual possuiríamos somente alguns alunos com informações faltantes em algumas colunas, porém, existe também a possibilidade de uma coluna inteira estar representada com nula, afetando todas as linhas(alunos) da tabela.</p>

## 1.2 Tipos
<p> Existem alguns tipos de "missing data" que são categorizados através do porquê aquele dado está faltando, e entender cada tipo deles é importante para sabermos como iremos tratar não só os dados com os valores normais, mas também os própios dados nulos. As três categorias estabelecidas são: Faltando Completamente de Forma Aleatória (MCAR), Faltando de Forma Aleatória (MAR), Faltando de Forma Não Aleatória (MNAR).</p>

### 1.2.1 Faltando Completamente de Forma Aleatória (MCAR)
<p> Nesse tipo, a razão pela qual os valores estão faltando não possuem qualquer tipo de lógica, ou padrão, ou seja, não há relação entre os valores que estão faltando e qualquer outra informação presente na base de dados ou outro valor ausente. Então, nesse tipo não é possível prever os motivos pelo qual as informações estão ausentes. </p>
<p> Abaixo está uma tabela, que representa esse tipo de "missing data". Cabe afirmar, que não é possível realizar uma análise sobre o motivo dos valores nulos, já que os Nomes que os possuem não se relacionam, e também não há um padrão nos CR's (Coeficiente de Rendimento) que estão informados, já que há baixos, médios e altos. </p>

In [35]:
mcar

      Nome   CR
0    Tiago  NaN
1     João  3.2
2  Gustavo  9.0
3    Pedro  NaN
4    César  6.5
5     Luís  NaN
6   Mateus  NaN
7     Luca  1.7
8      Yan  5.0

### 1.2.2 Faltando de Forma Aleatória (MAR)
<p> Nessa categoria, o motivo dos valores nulos estão relacionados, somente com as informações observadas (não nulas) da tabela. Abaixo está uma tabela, que possui dados que estão "Faltando de Forma Aleatória". É possível criar uma hipótese que todas as pessoas com as idades <= 20, estão com o CR faltando. </p>

In [36]:
mar

      Nome  Idade    CR
0    Tiago     17   NaN
1     João     18   NaN
2  Gustavo     18   NaN
3    Pedro     19   NaN
4    César     20   NaN
5     Luís     21  10.0
6   Mateus     22   2.5
7     Luca     22   1.7
8      Yan     23   5.0

### 1.2.3 Faltando de Forma Não Aleatória (MNAR)
<p> Nesse modelo, o porquê da falta de informações se deve a um comportamento dos próprios dados nulos. Através da tabela abaixo, é viável analisar que CR's abaixo da média (5.0) estão nulos. </p>

In [37]:
mnar

      Nome    CR
0    Tiago   8.0
1     João   NaN
2  Gustavo   9.0
3    Pedro   NaN
4    César   6.5
5     Luís  10.0
6   Mateus   NaN
7     Luca   7.5
8      Yan   5.0

## 1.3 Influência na Análise de Dados e na Criação de Modelos Preditivos
<p> </p>